{
    "Song": [{
        "title": "Come Back To Earth",
        "artist": "Mac Miller",
        "lyrics": "My regrets look just like texts I shouldn't send And I got neighbors they're more like strangers We could be friends I just need a way out Of my head I'll do anything for a way out Of my head In my own way this feel like livin Some alternate reality And I was drownin but now I'm swimmin Through stressful waters to relief Yeah oh the things I'd do To spend a little time in Hell And what I won't tell you I'll prolly never even tell myself Don't you know that sunshine don't feel right When you inside all day? I wish it was nice out but it look like rain Grey skies are driftin not livin' forever They told me it only gets better My regrets look just like texts I shouldn't send And I got neighbors they're more like strangers We could be friends I just need a way out Of my head I'll do anything for a way out Of my head"
    },
    {
        "title": "Hurt Feelings",
        "artist": "Mac Miller",
        "lyrics": "Yeah Yeah yeah Yeah yeah Yeah yeah Yeah yeah Well okay I'm always sayin I won't change but I ain't the same Everything is different I can't complain Don't know what you missing Shame on you Yeah yeah yeah Shame on you Everything is strange that's just a game Everybody tripping throwing it away We was getting lifted now we getting paid Shame on you I pay the cost to see apostrophes That means it's mine keep to myself taking my time Always into some bullshit and out of line Driving with my eyes close missing all the signs Turn the ignition I'm driven and sitting pretty Listening to Whitney and whipping it through the city yeah Man on a mission figure it out Putting way too much on my shoulders please hold me down I keep my head above the water (Water) My eyes is getting bigger so the world is getting smaller (Smaller) I've been getting richer but that only made me crazy Mama told me I was different even when I was a baby That Mercedes through the PA when I pull up sounded like a concert Or a or a monster truck I'm tripping but I'm falling up I always said I want it all but it's not enough Okay I'm always saying I won't change but I ain't the same Everything is different I can't complain Don't know what you missing Shame on you Yeah yeah yeah Shame on you Everything is strange that's just a game Everybody tripping throwing it away We was getting lifted now we getting paid Shame on you We only just begun No we don't wanna hurt your feelings I was only just begun No we don't wanna Hurt (Hurt) Feelings (Feelings) Down go the system long live the king Turn the power off and get your water from the spring I'm bringing everyone with me when shit get iffy I give a hundred and fifty percent This is the shit that I'm dealing with but wish I forget Used to be feeling depressed Now that I'm living and I'm feeling obsessed Yes high in Jacuzzi's I been hitting the jets I'm showing her some love she been giving me sex Bless bless bless Respect the outline don't fuck around and be a victim of your pride Why you lying? (Why you lying?) Tell the truth and step aside I don't got the time to let it slide (Yep) I'm too grounded push whips that move mountains New crib blue fountains These are my surroundings I've been going through it you just go around it But it's really not that different when you think about it I'm always saying I won't change but I ain't the same Everything is different I can't complain Don't know what you missingShame on you Yeah yeah yeah Shame on you Everything is strange that's just a game Everybody tripping throwing it away We was getting lifted now we getting paid Shame on you Hurt Feelings"
    },
    {
        "title": "What's The Use?",
        "artist": "Mac Miller",
        "lyrics": "You can love it you can leave it They say you're nothing without it Don't let them keep you down What if I don't need it? There's something about it That just freaks me outI just want another minute with it fuck a little what's the use? Never superficial you gon' know it when it hit you Get a little sentimental when I'm off the juice Yeah okay we colder than the breeze But the breeze ain't flowin' like me motherfucker hol' up You don't need to hol' up yeah And I can show you how it seem what it is what it truly might be Nothing that you know of you don't need to hol up I'm so above and beyond you take drugs to make it up Way up where we on space shuttle Elon Time we don't waste much fuck and we wake up Then I have her sing just like Céline Dion Catch me if you can but you'll never catch me damn Whole lotta yes I am All the way in with no exit plan Already left and the jet don't land Yeah the time is ticking Come take a ride get inside this is highly different I'm talking fly got the pilot with me Can I mind my business? Why you trippin? Give you somethin that your eyes can witness Ooh too close I don't understand why you doing the most (ooh) You can love it you can leave it They'll say you're nothing without it Don't let them keep you down What if I don't need it? There's something about it That just freaks me out I just want another minute with it fuck a little What's the use? (What's the use?) Never superficial you gon' know it when it hit you Get a little sentimental when I'm off the juice (turn it up) Well I'ma give you what you came for yeah Shit I've worked too hard to have a clue who you are Set the bar so far above par we can parlay all day Crib long range with the yard I know I should probably pray more but you gotta love me Cause I save the day spend money When I had nothing shit it wasn't so funny Made a promise to the homies nobody'd go hungry Look how far we came still they throwin' dirt on my name But it never worried my brain Heads turnin like a hurricane swervin Tell the sun get up outta my shade They don't get the picture cut em out of my frame shit Im up 30 thou miles plus change It's been a while but I'm down til I'm out And it is what it is til it ain't Ooh oh oh I just wanna fly ah You can love it you can leave it They say you're nothing without it Don't let them keep you down What if I don't need it? There's something about it That just freaks me out I just want another minute with it fuck a little What's the use? (What's the use?) Never superficial you don't know it when it hit you Get a little sentimental when I'm off the juice (ooh) You can love it It just freaks me out"
    },
    {
        "title": "Perfecto",
        "artist": "Mac Miller",
        "lyrics": "Yeah yeah yeah yeah Yeah yeah Yeah yeah yeah yeah Well it ain't perfect but I don't mind Because it's worth it Who really has the time at all? It ain't perfect but I don't mind Cause on the surface I look so fine But really I'm buggin buggin Makin somethin' out of nothin Yeah as hard as it gets cool calm and collected Holdin my breath this ain't what I expected Don't argue to death pull my heart out of my chest The cards are all on the table I'm callin it Don't say it I swallow it When livin' off of borrowed time Often I'm on the fence on a line Addin up what's on my mind My feet on the clouds head on the ground That we goin down bet you know me now I'm treadin water I swear That if I drown I don't care They callin' for me from the shore I need more Well it ain't perfect but I don't mind Because it's worth it (is it? is it? is it? is it? is it?) Who really has the time (is it? is it? is it? is it? is it?) It ain't perfect but I don't mind Cause on the surface I look so fine But really I'm buggin buggin Makin somethin out of nothin Yeah it feel like the weekend on the Tuesday I can move dates I got somethin else to do day always do hate If I do say the D'USSÉ with the homies like it's Kool-Aid Me? I'm just tryna play it cool J (anyways) Yeah mind over matter I'm purer than alkaline Been stuck on album time I gotta get out to shine Fly on the wall shit I was buggin Miss me like you gettin withdrawal I keep that comin yeah I'm treadin water I know If I stop movin I'll float They nothin new it- (just play it cool baby just play it cool) (You know cool) Well it ain't perfect but I don't mind Because it's worth it Who really has the time at all It ain't perfect but I don't mind Cause on the surface I look so fine But really I'm buggin buggin Makin somethin out of nothin Yeah tell me you love me spin me around Pretty please pick me up in the air and don't put me down Seen it all unfold sat back and watched Knowin time don't give a fuck about clocks until they stop Bare feet runnin late her car started Even though the only thing that she drivin a hard bargain More important is I'm kinda sorta out the door but She put me back together when I'm out of order Perfect"
    },
    {
        "title": "Self Care",
        "artist":"Mac Miller",
        "lyrics": "Mhm mhm Okay Yeah yeah yeah yeah Yeah yeah yeah Dollars I switched the time zone but what do I know? Spendin nights hitchhikin where will I go? I could fly home with my eyes closed But it'd get kinda hard to see that's no surprise though And you could find me I ain't hidin I don't move my feet when I be glidin I just slide in and then I roll out Yep Well climbin over that wall (yeah wall wall) mm I remember yes I remember yes I remember it all Swear the height be too tall (yeah) so like September I fall (Down down down) down below Now I know that the medicine be on call yeah (gimme gimme gimme) When it's feelin like you hot enough to melt yeah (melt yeah) Can't trust no one can't even trust yourself yeah (self yeah) And I love you I don't love nobody else yeah (else yeah) Tell them they can take that bullshit elsewhere (yeah) Self-care I'm treatin me right yeah Hell yeah we gonna be alright (we gon be alright) I switched the time zone (yeah) but what do I know? (Yeah) Spendin nights hitchhikin where will I go? I could fly home (yeah) with my eyes closed (yeah) But it'd get kinda hard to see that's no surprise though And you could find me (yeah) I ain't hidin (yeah) I don't move my feet when I be glidin I just slide in (yeah) and then I roll out Been on the road I don't see it Out on the road I don't see where I'm going Yeah I been readin them signs (wow yeah yeah yeah yeah) I been losin my I been losin my I been losin my mind yeah (yeah) Get the fuck out the way (kay) must be this high to play (okay) It must be nice up above the lights and what a lovely life that I made yeah (uh) I know that feelin like it's in my family tree yeah (whoa) That Mercedes drove me crazy I was speedin Somebody save me from myself yeah Tell them they can take that bullshit elsewhere Self-care we gonna be good Hell yeah they lettin me go-o-o-o-o-o-o-o I switched the time zone (yeah) but what do I know? (Yeah) Spendin nights hitchhikin where will I go? (Yeah) I could fly home (yeah) with my eyes closed (yeah) But it'd get kinda hard to see that's no surprise though (yeah) And you could find me (yeah) I ain't hidin (yeah) I don't move my feet when I be glidin (yeah) I just slide in (yeah) and then I roll out I didn't know I didn't know I didn't know I didn't know yeah Well didn't know what I was missin now I see a lil different I was thinkin too much Got stuck in oblivion yeah yeah Oblivion yeah yeah Oblivion yeah yeah I got all the time in the world so for now I'm just chillin Plus I know it's a it's a beautiful feelin In oblivion yeah yeah Oblivion yeah yeah Oblivion yeah yeah Yeah Okay I ride around my city when I come home yeah The sun set quickly then get up slow yeah I just connect and upload Watch it spin around we just spinnin round yeah Let's go and travel through the unknown yeah We play it cool we know we fucked though yeah You keep on sayin you in love so Tell me are you really down? Are you really down? Yeah Let's go back to my crib and play some 45's It's safe in there I know there's still a war outside We spend our nights all liquored up our mornings high Can you feel it now? Oblivion yeah yeah Oblivion yeah yeah yeah yeah yeah yeah yeah Oblivion yeah yeah Ooh-ooh ooh-ooh I got all the time in the world so for now I'm just chillin' Plus I know it's a it's a beautiful feelin In oblivion yeah yeah Oblivion yeah yeah Oblivion yeah yeah"
    },
    {
        "title": "Wings",
        "artist": "Mac Miller",
        "lyrics": "Yeah Well I got a bone to pick like roses (roses) I ain't feelin broken no more Balled a fist they gossipin' I notice Talkin shit I wander through the motives Wonder who the fuck I'm supposed to be I ain't worried now til I leave I'm just tryna ride and feel the breeze With somethin bad beside next to me Wind in my face Don't stop now when it feels so great You can run til you slip on the sidewalk And the same bone you pick gon break That's a motif (that's a motif) Yeah when it's comin right back So familiar never been realer Never felt so damn good where I'm at I don't know what it's all about Runnin through the many thoughts to count (that's way better) Still ain't addin up I'll let you know that I've had enough yeah Yeah yeah well I'd put some money on forever but I (hey) Don't like to gamble on the weather so I just watch while The sun is shinin I can look at the horizon The walls keep gettin wider I just hope I never find em I know Hey Well these are my wings These are my wings yeah These are my wings Yeah well Movin so fast the clock look slow (slow) Water my seeds til the flower just grow yeah Love so much that my heart get broke I don't really know how the normal shit go so I guess I just play it by ear silence is all that I hear Listenin close as I can Growin up (one two three) jump Nobody holdin my hand no trust is a problem never knew how yeah That's why I just keep to myself Get what I need then I'll be out (please tell me) Who can surf the universe with me? Lucifer is human so are we All I ever want is what I need And that don't include your time and company Follow me we on the up and up Remember when I owed a hundred bucks Now I look around like What the fuck? If you don't fuck with me you fuckin up I know I need to watch my temper so I Don't ever gamble on the weather but I just watch while the The sun is shinin I can look at the horizon The walls keep gettin wider I just hope I never find em no no Yeah well These are my wings These are my wings These are my wings"
    },
    {
        "title": "Baby Got Back",
        "artist": "Sir Mix-a-Lot",
        "lyrics": "Oh my God Becky look at her butt It is so big she looks like One of those rap guys' girlfriends But, ya know, who understands those rap guys? They only talk to her, because She looks like a total prostitute, okay? I mean, her butt, it's just so big Uh, I can't believe it's just so round, it's like out there I mean, uh, gross, look She's just so, black I like big butts and I cannot lie You other brothers can't deny That when a girl walks in with an itty bitty waist And a round thing in your face You get sprung, want to pull up tough 'Cause you noticed that butt was stuffed Deep in the jeans she's wearing I'm hooked and I can't stop staring Oh baby, I wanna get wit'cha And take your picture My homeboys tried to warn me But that butt you got makes (me, me so horny) Ooh, Rump-o'-smooth-skin You say you want to get in my Benz? Well, use me, use me 'Cause you ain't that average groupie I've seen her dancin' To hell with romancin' She's sweat, wet Got it goin' like a turbo 'Vette I'm tired of magazines Sayin' flat butts are the thing Take the average black man and ask him that She gotta pack much back So, fellas (yeah) fellas (yeah) Has your girlfriend got the butt? (Hell yeah) Tell 'em to shake it (shake it) shake it (shake it) Shake that healthy butt Baby got back (L.A. face with the Oakland booty) Baby got back (L.A. face with the Oakland booty) (L.A. face with the Oakland booty) I like 'em round, and big And when I'm throwin' a gig I just can't help myself, I'm actin' like an animal Now here's my scandal I wanna get ya home And ugh, double-up, ugh, ugh I ain't talkin' bout Playboy 'Cause silicone parts are made for toys I want 'em real thick and juicy So find that juicy double Mix-a-lot's in trouble Beggin' for a piece of that bubble So I'm lookin' at rock videos Knock-kneed bimbos walkin' like hoes You can have them bimbos I'll keep my women like Flo Jo A word to the thick soul sistas, I want to get with ya I won't cuss or hit ya But I gotta be straight when I say I wanna (uh) 'Til the break of dawn Baby got it goin' on A lot of simps won't like this song 'Cause them punks like to hit it and quit it And I'd rather stay and play 'Cause I'm long, and I'm strong And I'm down to get the friction on So, ladies (yeah) ladies (yeah) If you wanna roll in my Mercedes (yeah) Then turn around, stick it out Even white boys got to shout Baby got back Baby got back Yeah, baby, when it comes to females Cosmo ain't got nothin' to do with my selection Thirty-six, twenty-four, thirty-six Ha ha, only if she's 5 3 So your girlfriend rolls a Honda, playin' workout tapes by Fonda But Fonda ain't got a motor in the back of her Honda My anaconda don't want none Unless you've got buns, hun You can do side bends or sit-ups But please don't lose that butt Some brothers want to play that hard role And tell you that the butt ain't gold So they toss it and leave it And I pull up quick to retrieve it So Cosmo says you're fat Well I ain't down with that 'Cause your waist is small and your curves are kickin' And I'm thinkin' bout stickin' To the beanpole dames in the magazines You ain't it, Miss Thing Give me a sista I can't resist her Red beans and rice didn't miss her Some knucklehead tried to diss Cause his girls are on my list He had game but he chose to hit em And I pull up quick to get wit em So ladies if the butt is round And you want a triple X throwdown Dial 1-900-MIXALOT And kick them nasty thoughts Baby got back Baby got back"
    }]
}